{
    "database_id": 269,
    "label": "VRP03",
    "manufacturer_name": "Leviton",
    "manufacturer_id": "001D",
    "device_ref": [
        "0202:030B"
    ],
    "version_min": 0,
    "version_max": 255.255,
    "decription": "300W Scene Capable Plug-In Lamp Dimming Module",
    "overview": "<p>The Vizia RF+ 300W Scene Capable Plug-In Lamp Dimming Z-Wave Module is ideal where remote dimming of a an incandescent load up to 300 watts is needed. This smart plug-in module has robust features like zone control, scene control and tmed events to give you one-touch control of your home's lighting and any Z-Wave enabled device. Typical applications would be to dim a table or floor lamp.<\/p>",
    "inclusion": "<ul><li>If using a non-Leviton Programmer\/Remote, refer to the Programmer\/Remote instruction sheet for Including a device.<\/li> <li>If using the VRCPG's Install Checklist feature, go directly to Step B.<\/li> <\/ul><p>A) If using a Leviton Z-Wave® Programmer\/Remote, Cat. No. VRCPG, press the Menu button and scroll down to System Setup. Press the center  button to select System Setup Menu. Choose Advanced Settings. Press the center button to select Network.<\/p> <p>B) While standing close to the module (approximately 2-5 ft.), press the center button to &lt;Include&gt; device in the network. <\/p> <p>NOTE: Only one device may be included at a time. DO NOT put multiple devices into the Inclusion mode at any time.<\/p> <p>C) While the Programmer\/Remote is in the Inclusion mode and the LED is ON on the Scene Capable Plug-In Lamp Dimming Module, press the ON\/OFF button on the module. The Programmer\/Remote will verify inclusion and the LED will turn OFF on the Scene Capable Plug-In Lamp Dimming Module.<\/p> <p>If the Scene Capable Plug-In Lamp Dimming Module is flashing Amber while in the Inclusion mode, the Programmer\/Remote is still trying to communicate with the Scene Capable Plug-In Lamp Dimming Module. Wait until the device stops flashing, then press ON\/OFF button.<\/p> <p>NOTE: If the LED on the Scene Capable Plug-In Lamp Dimming Module turns solid Red while including, there has been a communication error. Refer to Troubleshooting section.<\/p> <p>D) The Primary Programmer\/Remote will assign a node ID number (Name) for this module.<\/p> <p>NOTE: This ID number (Name) will be stored in the controller to be used for future reference.<\/p> <p>NOTE: You may name or edit the node of this device at this time.<\/p> <p>E) The module is now installed in the network.<\/p> <p>Note: If the module has been successfully Included in the network and the user tries to Include it again without first excluding it from the network, the module will retain the first node ID it had received and ignore the second.<\/p>",
    "exclusion": "<p>NOTE: It is very important to accurately Exclude devices from the network when moving or removing a device from a Z-Wave® network. This ensures that all information has been removed from your Primary Programmer\/Remote’s information table and is not counted on to be a part of the mesh network.<\/p> <p>A) If using a Leviton Z-Wave® Programmer\/Remote, Cat. No. VRCPG, press the Menu button and scroll down to System Setup. Press the center button to select System Setup Menu. Choose Advanced Settings. Press the center button to select Network.<\/p> <p>B) While standing close to the module, press the center button to &lt;Exclude&gt; device from the network.<\/p> <p>NOTE: Only one device may be excluded at a time.<\/p> <p>C) While the Programmer\/Remote is in the Exclusion mode and the LED is ON on the Scene Capable Plug-In Lamp Dimming Module, press the ON\/OFF button on the module. The Programmer\/Remote will verify Exclusion and the LED will turn OFF on the Scene Capable Plug-In Lamp Dimming Module. If the Scene Capable Plug-In Lamp Dimming Module is flashing Amber while in the Exclusion mode, the Programmer\/Remote is still trying to communicate with the module. Wait until the device stops flashing, then press the ON\/OFF button.<\/p> <p>Factory Default:<\/p> <p>If your module is not responding, or you are unable to control it after you have tried to Include\/Exclude it multiple times, it may be necessary to reset the module to its original factory settings. To accomplish this, proceed as follows: • Unplug the module and wait 5 seconds. Plug the module back in and within 20 seconds press and hold the programming button until the LED turns Amber and then turns Red. The module is now reset. Once the module is reset, it will be necessary to Re-Include it to a network before it can be used.<\/p> <p>CAUTION: SETTING A DEVICE TO A FACTORY DEFAULT DOES NOT EXCLUDE THAT DEVICE FROM A NETWORK. THE EXCLUSION PROCEDURE MUST STILL BE FOLLOWED TO REMOVE THE DEVICE FROM THE PRIMARY REMOTE’S INFORMATION TABLE. FAILURE TO DO SO MAY RESULT IN SYSTEM THAT IS SLOW TO RESPOND, ORMAY FAIL TO RESPOND TO SOME DEVICES.<\/p>",
    "wakeup": "",
    "protocol_version": 0,
    "listening": true,
    "frequently_listening": false,
    "routing": true,
    "beaming": true,
    "library_type": {
        "id": 0,
        "name": "Unknown"
    },
    "basic_class": {
        "id": 4,
        "name": "BASIC_TYPE_ROUTING_SLAVE"
    },
    "generic_class": {
        "id": 4,
        "name": "GENERIC_TYPE_SWITCH_MULTILEVEL"
    },
    "specific_class": {
        "id": 4,
        "name": "SPECIFIC_TYPE_SCENE_SWITCH_MULTILEVEL"
    },
    "endpoints": [
        {
            "id": 0,
            "basic_class": {
                "id": 4,
                "name": "BASIC_TYPE_ROUTING_SLAVE"
            },
            "generic_class": {
                "id": 17,
                "name": "GENERIC_TYPE_SWITCH_MULTILEVEL"
            },
            "specific_class": {
                "id": 4,
                "name": "SPECIFIC_TYPE_SCENE_SWITCH_MULTILEVEL"
            },
            "commandclasses": [
                {
                    "id": "00",
                    "name": "NO_OPERATION",
                    "version": "1",
                    "nif": false,
                    "basic": false,
                    "secure": false,
                    "nonsecure": true,
                    "config": "",
                    "channels": []
                },
                {
                    "id": "20",
                    "name": "BASIC",
                    "version": "1",
                    "nif": false,
                    "basic": false,
                    "secure": false,
                    "nonsecure": true,
                    "config": "FORCEVERSION",
                    "channels": []
                },
                {
                    "id": "26",
                    "name": "SWITCH_MULTILEVEL",
                    "version": "1",
                    "nif": false,
                    "basic": false,
                    "secure": false,
                    "nonsecure": true,
                    "config": "FORCEVERSION",
                    "channels": [
                        {
                            "type": "switch_dimmer",
                            "label": "Dimmer",
                            "config": []
                        }
                    ]
                },
                {
                    "id": "27",
                    "name": "SWITCH_ALL",
                    "version": "1",
                    "nif": false,
                    "basic": false,
                    "secure": false,
                    "nonsecure": true,
                    "config": "FORCEVERSION",
                    "channels": []
                },
                {
                    "id": "2B",
                    "name": "SCENE_ACTIVATION",
                    "version": "1",
                    "nif": false,
                    "basic": false,
                    "secure": false,
                    "nonsecure": true,
                    "config": "FORCEVERSION",
                    "channels": [
                        {
                            "type": "scene_number",
                            "label": "Scene Number",
                            "config": []
                        }
                    ]
                },
                {
                    "id": "2C",
                    "name": "SCENE_ACTUATOR_CONF",
                    "version": "1",
                    "nif": false,
                    "basic": false,
                    "secure": false,
                    "nonsecure": true,
                    "config": "FORCEVERSION",
                    "channels": []
                },
                {
                    "id": "72",
                    "name": "MANUFACTURER_SPECIFIC",
                    "version": "1",
                    "nif": false,
                    "basic": false,
                    "secure": false,
                    "nonsecure": true,
                    "config": "FORCEVERSION",
                    "channels": []
                },
                {
                    "id": "73",
                    "name": "POWERLEVEL",
                    "version": "1",
                    "nif": false,
                    "basic": false,
                    "secure": false,
                    "nonsecure": true,
                    "config": "FORCEVERSION",
                    "channels": []
                },
                {
                    "id": "77",
                    "name": "NODE_NAMING",
                    "version": "1",
                    "nif": false,
                    "basic": false,
                    "secure": false,
                    "nonsecure": true,
                    "config": "FORCEVERSION",
                    "channels": []
                },
                {
                    "id": "82",
                    "name": "HAIL",
                    "version": "1",
                    "nif": false,
                    "basic": false,
                    "secure": false,
                    "nonsecure": true,
                    "config": "FORCEVERSION",
                    "channels": []
                },
                {
                    "id": "85",
                    "name": "ASSOCIATION",
                    "version": "1",
                    "nif": false,
                    "basic": false,
                    "secure": false,
                    "nonsecure": true,
                    "config": "FORCEVERSION",
                    "channels": []
                },
                {
                    "id": "86",
                    "name": "VERSION",
                    "version": "1",
                    "nif": false,
                    "basic": false,
                    "secure": false,
                    "nonsecure": true,
                    "config": "FORCEVERSION",
                    "channels": []
                },
                {
                    "id": "91",
                    "name": "MANUFACTURER_PROPRIETARY",
                    "version": "1",
                    "nif": false,
                    "basic": false,
                    "secure": false,
                    "nonsecure": true,
                    "config": "FORCEVERSION",
                    "channels": []
                },
                {
                    "id": "EF",
                    "name": "MARK",
                    "version": "1",
                    "nif": false,
                    "basic": false,
                    "secure": false,
                    "nonsecure": true,
                    "config": "FORCEVERSION",
                    "channels": []
                }
            ]
        }
    ],
    "parameters": [],
    "associations": [
        {
            "id": 1,
            "label": "Group 1",
            "max_nodes": 5,
            "controller": true,
            "description": "",
            "overview": ""
        }
    ]
}