{
    "database_id": 229,
    "label": "004001",
    "manufacturer_name": "Popp & Co",
    "manufacturer_id": "0154",
    "device_ref": [
        "0100:0201"
    ],
    "version_min": 0,
    "version_max": 255.255,
    "decription": "Smoke Detector and Siren",
    "overview": "<h1>Secure Z-Wave Smoke Sensor plus Siren<\/h1> <h3>SKU: POPE004001<\/h3> <h3>Quickstart<\/h3> <p>This is a <b>secure Z-Wave Device <\/b>for <b>Europe<\/b>. To run this device please insert fresh <b>1 * 9V Block<\/b> batteries. Please make sure the internal battery is fully charged.<\/p> <p>Pressing the button (3) for one second includes and excludes the device. The smoke sensor is powered either by an internal battery or an <strong>optional external integrated power supply<\/strong>. It supports secure communication and will, without further configuration, notify other smoke sensors and sirens of the same type when an alarm occurs.<\/p> <h3>What is Z-Wave?<\/h3> <p>Z-Wave is the international wireless protocol for communication in the Smart Home. This device is suited for use in the region mentioned in the Quickstart section. (For more information about frequency regulations please refer to the frequency coverage overview at Sigma Designs Website ).<\/p> <p>Z-Wave ensures a reliable communication by reconfirming every message (<b>two-way communication<\/b>) and every mains powered node can act as a repeater for other nodes (<b>meshed network<\/b>) in case the receiver is not in direct wireless range of the transmitter.<\/p> <p>This device and every other certified Z-Wave device can be <b>used together with any other certified Z-Wave device regardless of brand and origin <\/b>as long as both are suited for the same frequency range.<\/p> <p>If a device supports <b>secure communication<\/b> it will communicate with other devices secure as long as this device provides the same or a higher level of security. Otherwise it will automatically turn into a lower level of security to maintain backward compatibility.<\/p> <p>For more information about Z-Wave technology, devices, white papers etc. please refer to www.z-wave.info.<\/p> <h3>Product Description<\/h3> <p>This product combines a certified stand-alone smoke detector with an insertable Z-Wave module. The smoke detector is certified by the VdS and DIN EN 14604 and satisfies all legal requirements. The smokebox is made of steel and antistatic plastic.<\/p> <p>A button on the device can be used to test the smokebox, the electronics and the battery. In addition the device has an integrated test functionality to make manual tests with Aerosol unnecessary. The battery warning gets send for at least 30 days. During this time the smoke sensor stays fully functional.<\/p> <p>The Z-Wave radio module enables the smoke and battery alarms to be transmitted to a central Z-Wave controller. The smoke sensor can also be used as Z-Wave siren; for that the Z-Wave controller sends an on or off command to the siren. The radio module uses either the smoke sensors integrated 9V battery or can be powered by an external 12V power supply.<\/p> <p>According to the VdS 3515 (smoke sensors with radio communication) this device will relay all alarms to all other smoke sensors (004001) in the Z-Wave network to create a house-wide alarm. This connection of the smoke sensors is fully automatical and needs no further configuration. The smoke sensors and the controller communicate via an secure protocol to prevent manipulation.<\/p> <h3>Prepare for Installation \/ Reset<\/h3> <p>Please read the user manual before installing the product.<\/p> <p>In order to include (add) a Z-Wave device to a network it <b>must be in factory default state.<\/b> Please make sure to reset the device into factory default. You can do this by performing an Exclusion operation as described below in the manual. Every Z-Wave controller is able to perform this operation however it is recommended to use the primary controller of the previous network to make sure the very device is excluded properly from this network.<\/p> <h4>Reset to factory default<\/h4> <p>This device also allows to be reset without any involvement of a Z-Wave controller. This procedure should only be used when the primary controller is inoperable.<\/p> <p>press the button on the bottom of the device for at least 10 seconds<\/p> <h4>Safety Warning for Batteries<\/h4> <p>The product contains batteries. Please remove the batteries when the device is not used. Do not mix batteries of different charging level or different brands.<\/p> <h3>Installation<\/h3> <p>Please refer to the installation guide of the smoke sensor for information about how and where the smoke sensor should be installed. The installation guide complies with the norm DIN EN 14676.<\/p> <ul><li>Remove the bracket from the detector main unit by rotating it counter-clockwise.<\/li> <li>Place the bracket where you are going to install the detector. In each of keyhole slots, draw a mark to locate plastic anchor and screw. Using a 3\/16-inch (5mm) drill bit, drills two holes at the marks and insert plastic anchor, and attached the bracket by using the screws.<\/li> <li>Open the battery compartment (1) to activate the battery, and then close the cover.<\/li> <li>The optional external power supply will connect to the connector (5). The internal battery must stay inside the detector even when the external power supply is connected.<\/li> <li>Mount the smoke detector to the mounting ring. Make sure the hooks of the detector are placed between the hook and the twist stopper (2) of the mounting base (arrows in image above). Then turn about 15 % clockwise. (Hint. If the detector hook is not placed right between the two mounting ring structures the detector can?t be mounted to the ring).<\/li> <\/ul><p>Please follow the recommendations about amount as position of the sensor in your home as given above. Avoid to place the sensor into the angle of walls, prefer positions in the middle of the room.<\/p> <h3>Inclusion\/Exclusion<\/h3> <p>On factory default the device does not belong to any Z-Wave network. The device needs to be <b>added to an existing wireless network<\/b> to communicate with the devices of this network. This process is called <b>Inclusion<\/b>.<\/p> <p>Devices can also be removed from a network. This process is called <b>Exclusion<\/b>. Both processes are initiated by the primary controller of the Z-Wave network. This controller is turned into exclusion respective inclusion mode. Inclusion and Exclusion is then performed doing a special manual action right on the device.<\/p> <h4>Inclusion<\/h4> <p>A single click on the button (3) includes the device. If the button is pressed for at least 2 seconds the inclusion will be done without the (<em>Security Command Class <\/em>). <\/p> <h4>Exclusion<\/h4> <p>A single click on the button will exclude the device.<\/p> <h3>Product Usage<\/h3> <p>In case smoke is detected by the smoke detector the device will sound, the red LED will blink and the wireless module will issue a Z-Wave alarm command to the main controller and other associated devices. A low battery will be indicated on short siren noise plus the Z-Wave controller will be informed using Battery Low warning commands.<\/p> <p><em>Note: All communication of the wireless module is performed with application level security if the device was included securely and all communication partners support secure communication as well. In case a non-secure device is associated for switching on smoke alarm, the smoke detector will detect this and change its communication styla with this very device to non-secure. This process happens one time and will take about 20 seconds. This delay will happen on first communication only.<\/em><\/p> <p>The siren can be used for other alarm indication. For this reason the device will be shown at Graphical user interface as a simple on\/off switch. Turning on this switch start the siren, turning it off will stop the noise. The generic siren alarm has a different acoustic pattern than the permanent sound caused by smoke. The configuration parameters 1 and 2 define the style of the sound.<\/p> <p><strong>Automatic radio meshing of the smoke sensor<\/strong><\/p> <p>Thanks to Z-Wave the smoke sensor can communicate fully automatic. In case of an alarm (smoke or battery) the device will send a notification to all other smoke sensors in the network. The receiving smoke sensor transmit the alarm to other smoke sensors until all smoke sensors have received the alarm.<\/p> <p>It is possible to wirelessly turn off the siren on all repeating smoke detectors but not on the detector that originally sent the alarm. You must find and remove the reason for the smoke detector to buzz.<br \/><br \/><strong>Please note that this meshing is not recommended for networks with more than 3 smoke detectors. In this case please control theme using a central controller and turn off the meshing function by setting configuration parameter 5 and 6.<\/strong><\/p> <h3>Node Information Frame<\/h3> <p>The Node Information Frame (NIF) is the business card of a Z-Wave device. It contains information about the device type and the technical capabilities. The inclusion and exclusion of the device is confirmed by sending out a Node Information Frame. Beside this it may be needed for certain network operations to send out a Node Information Frame. To issue a NIF execute the following action:<\/p> <p>A simple click on the button (3) sends a NIF.<\/p> <h3>Quick trouble shooting<\/h3> <p>Here are a few hints for network installation if things dont work as expected.<\/p> <ol><li>Make sure a device is in factory reset state before including. In doubt exclude before include.<\/li> <li>If inclusion still fails, check if both devices use the same frequency.<\/li> <li>Remove all dead devices from associations. Otherwise you will see severe delays.<\/li> <li>Never use sleeping battery devices without a central controller.<\/li> <li>Dont poll FLIRS devices.<\/li> <li>Make sure to have enough mains powered device to benefit from the meshing<\/li> <\/ol><h3>Association - one device controls an other device<\/h3> <p>Z-Wave devices control other Z-Wave devices. The relationship between one device controlling another device is called association. In order to control a different device, the controlling device needs to maintain a list of devices that will receive controlling commands. These lists are called association groups and they are always related to certain events (e.g. button pressed, sensor triggers, ...). In case the event happens all devices stored in the respective association group will receive the same wireless command wireless command, typically a 'Basic Set' Command.<\/p> <h4>Association Groups:<\/h4> <p>Group Number: 1, Maximum Nodes: 4, Description: Lifeline<\/p> <p>Group Number: 2, Maximum Nodes: 4, Description: Alarm Reports<\/p> <p>Group Number: 3, Maximum Nodes: 4, Description: Switching Command when Alarm<\/p> <h3>Configuration Parameters<\/h3> <p>Z-Wave products are supposed to work out of the box after inclusion, however certain configuration can adapt the function better to user needs or unlock further enhanced features.<\/p> <p><b>IMPORTANT:<\/b> Controllers may only allow configuring signed values. In order to set values in the range 128...255 the value sent in the application shall be the desired value minus 256. For example: To set a parameter to 200 it may be needed to set a value of 200 minus 256 = minus 56. In case of a two byte value the same logic applies: Values greater than 32768 may needed to be given as negative values too.<\/p> <h4>Parameter 1: Siren alarm sequence interval<\/h4> <p><i>The additional siren is creating a different acoustic signal differentiate from the smoke alarm. This sound is partly on and partly off. This parameter defines the total length of the interval in seconds. <\/i><br \/>Size: 2 Byte, Default Value: 10<\/p> <p>Setting Description<\/p> <p>03 - 127 seconds<\/p> <h4>Parameter 2: Siren alarm tone length<\/h4> <p><i>The additional siren is creating a different acoustic signal differentiate from the smoke alarm. This sound is partly on and partly off. This parameter defines the total length of the sound versus silence within this interval. <\/i><br \/>Size: 1 Byte, Default Value: 08<\/p> <p>Setting Description<\/p> <p>03 - 127 seconds<\/p> <h4>Parameter 3: Value of BASIC Set On-Command<\/h4> <p><br \/>Size: 1 Byte, Default Value: 99<\/p> <p>Setting Description<\/p> <p>00 - 99 Command Value<\/p> <h4>Parameter 4: Value of BASIC Set Off-Command<\/h4> <p><br \/>Size: 1 Byte, Default Value: 0<\/p> <p>Setting Description<\/p> <p>00 - 99 Command Value<\/p> <h4>Parameter 5: Status of automated meshing of smoke alarms<\/h4> <p><i>This smoke detector can automatically inform other smoke detectors of same type about smoke alarms. They will then also turn on the siren. This function is a requirement of wireless networked smoke detectors <\/i><br \/>Size: 1 Byte, Default Value: 01<\/p> <p>Setting Description<\/p> <p>00 inactive 01 active (default)<\/p> <h4>Parameter 6: Status of automated meshing of battery alarms<\/h4> <p><i>This smoke detector can automatically inform other smoke detectors of same type about battery alarms. They will then also turn on the siren. This function is a requirement of wireless networked smoke detectors. <\/i><br \/>Size: 1 Byte, Default Value: 01<\/p> <p>Setting Description<\/p> <p>00 inactive 01 active (default)<\/p> <h3>Technical Data<\/h3> <p>Hardware Platform ZM5202 IP Class IP 20 Battery Type 1 * 9V Block Firmware Version 01.00 Z-Wave Version 04.05 Z-Wave Product Id 0x0154.0x0100.0x0201<\/p> <h3>Supported Command Classes<\/h3> <ul><li>Basic<\/li> <li>Switch Binary<\/li> <li>Sensor Binary<\/li> <li>Association Grp Info<\/li> <li>Device Reset Locally<\/li> <li>Zwaveplus Info<\/li> <li>Configuration<\/li> <li>Alarm<\/li> <li>Manufacturer Specific<\/li> <li>Powerlevel<\/li> <li>Firmware Update Md<\/li> <li>Battery<\/li> <li>Association<\/li> <li>Version<\/li> <li>Security<\/li> <\/ul><h3>Controlled Command Classes<\/h3> <ul><li>Basic<\/li> <\/ul><h3>Explanation of Z-Wave specific terms<\/h3> <ul><li><b>Controller<\/b> — is a Z-Wave device with capabilities to manage the network. Controllers are typically Gateways,Remote Controls or battery operated wall controllers.<\/li> <li><b>Slave<\/b> — is a Z-Wave device without capabilities to manage the network. Slaves can be sensors, actuators and even remote controls.<\/li> <li><b>Primary Controller<\/b> — is the central organizer of the network. It must be a controller. There can be only one primary controller in a Z-Wave network.<\/li> <li><b>Inclusion<\/b> — is the process of adding new Z-Wave devices into a network.<\/li> <li><b>Exclusion<\/b> — is the process of removing Z-Wave devices from the network.<\/li> <li><b>Association<\/b> — is a control relationship between a controlling device and a controlled device.<\/li> <li><b>Wakeup Notification<\/b> — is a special wireless message issued by a Z-Wave device to announces that is able to communicate.<\/li> <li><b>Node Information Frame<\/b> — is a special wireless message issued by a Z-Wave device to announce its capabilities and functions.<\/li> <\/ul><h3>Support and Contact<\/h3> <p>Should you encounter any problem, please give us an opportunity to address it before returning this product. Most questions regarding Z-Wave wireless communication standard can be answered through the international users community such as www.z-wave.info and others. If your question can’t be answered there, please use www.popp.eu\/support or contact us by email: info@popp.eu<\/p> <p>While the information in this manual has been compiled with great care, it may not be deemed an assurance of product characteristics. Popp &amp; Co. shall be liable only to the degree specified in the terms of sale and delivery. The reproduction and distribution of the documentation and software supplied with this product and the use of its contents is subject to written authorization from Popp &amp; Co. We reserve the right to make any alterations that arise as the result of technical development.<\/p> <p><b>Phone: +49 (0) 40 537 98 13 339 <br \/>eMail: info@popp.eu<br \/>Web: www.popp.eu<\/b><\/p> <h3>Declaration of Conformity<\/h3> <p>Popp hereby declares this device complies with the essential requirements and other relevant prescriptions of Directive 1999\/5\/EC R&amp;TTE. The complete CE declaration can be found on: www.popp.eu\/ce.<\/p> <p>All questions regarding this declaration of conformity can be directed to the following address: Popp c\/o BID GmbH, Neuer Wall 63, 20148 Hamburg, Germany<\/p> <h3>Disposal Guidelines<\/h3> <p>Do not dispose of electrical appliances as unsorted municipal waste, use separate collection facilities. Contact your local government for information regarding the collection systems available. If electrical appliances are disposed of in landfills or dumps, hazardous substances can leak into the groundwater and get into the food chain, damaging health and well-being.<\/p>",
    "inclusion": "<p>A single click on the button (3) includes the device. If the button is pressed for at least 2 seconds the inclusion will be done without the (<em>Security Command Class <\/em>). <\/p>",
    "exclusion": "<h4>A single click on the button will exclude the device.<\/h4>",
    "wakeup": "",
    "protocol_version": 4.005,
    "listening": false,
    "frequently_listening": true,
    "routing": true,
    "beaming": true,
    "library_type": {
        "id": 7,
        "name": "LIB_CONTROLLER_BRIDGE"
    },
    "basic_class": {
        "id": 4,
        "name": "BASIC_TYPE_ROUTING_SLAVE"
    },
    "generic_class": {
        "id": 4,
        "name": "GENERIC_TYPE_SENSOR_NOTIFICATION"
    },
    "specific_class": {
        "id": 4,
        "name": "SPECIFIC_TYPE_NOTIFICATION_SENSOR"
    },
    "endpoints": [
        {
            "id": 0,
            "basic_class": {
                "id": 4,
                "name": "BASIC_TYPE_ROUTING_SLAVE"
            },
            "generic_class": {
                "id": 161,
                "name": "GENERIC_TYPE_SENSOR_ALARM"
            },
            "specific_class": {
                "id": 7,
                "name": "SPECIFIC_TYPE_ROUTING_SMOKE_SENSOR"
            },
            "commandclasses": [
                {
                    "id": "00",
                    "name": "NO_OPERATION",
                    "version": "1",
                    "nif": false,
                    "basic": false,
                    "secure": false,
                    "nonsecure": true,
                    "config": "",
                    "channels": []
                },
                {
                    "id": "20",
                    "name": "BASIC",
                    "version": "1",
                    "nif": false,
                    "basic": false,
                    "secure": false,
                    "nonsecure": true,
                    "config": "",
                    "channels": []
                },
                {
                    "id": "25",
                    "name": "SWITCH_BINARY",
                    "version": "1",
                    "nif": false,
                    "basic": true,
                    "secure": false,
                    "nonsecure": true,
                    "config": "",
                    "channels": [
                        {
                            "type": "switch_binary",
                            "label": "Switch",
                            "config": []
                        }
                    ]
                },
                {
                    "id": "30",
                    "name": "SENSOR_BINARY",
                    "version": "2",
                    "nif": false,
                    "basic": false,
                    "secure": false,
                    "nonsecure": true,
                    "config": "",
                    "channels": [
                        {
                            "type": "sensor_binary",
                            "label": "Binary Sensor",
                            "config": []
                        }
                    ]
                },
                {
                    "id": "70",
                    "name": "CONFIGURATION",
                    "version": "1",
                    "nif": false,
                    "basic": false,
                    "secure": false,
                    "nonsecure": true,
                    "config": "",
                    "channels": []
                },
                {
                    "id": "71",
                    "name": "ALARM",
                    "version": "1",
                    "nif": false,
                    "basic": false,
                    "secure": false,
                    "nonsecure": true,
                    "config": "",
                    "channels": [
                        {
                            "type": "alarm_general",
                            "label": "Alarm",
                            "config": []
                        }
                    ]
                },
                {
                    "id": "72",
                    "name": "MANUFACTURER_SPECIFIC",
                    "version": "1",
                    "nif": false,
                    "basic": false,
                    "secure": false,
                    "nonsecure": true,
                    "config": "",
                    "channels": []
                },
                {
                    "id": "80",
                    "name": "BATTERY",
                    "version": "1",
                    "nif": false,
                    "basic": false,
                    "secure": false,
                    "nonsecure": true,
                    "config": "",
                    "channels": []
                },
                {
                    "id": "85",
                    "name": "ASSOCIATION",
                    "version": "1",
                    "nif": false,
                    "basic": false,
                    "secure": false,
                    "nonsecure": true,
                    "config": "",
                    "channels": []
                },
                {
                    "id": "86",
                    "name": "VERSION",
                    "version": "1",
                    "nif": false,
                    "basic": false,
                    "secure": false,
                    "nonsecure": true,
                    "config": "",
                    "channels": []
                }
            ]
        }
    ],
    "parameters": [
        {
            "id": 1,
            "label": "Siren alarm sequence interval in seconds",
            "description": "This parameter defines the total length of the interval in seconds.",
            "overview": "<p>The additional siren is creating a different acoustic signal differentiate from the smoke alarm. This sound is partly on and partly off. This parameter defines the total length of the interval in seconds.<\/p>",
            "size": 1,
            "bitmask": "00000000",
            "default": 10,
            "read_only": false,
            "write_only": false,
            "value_min": 3,
            "value_max": 129,
            "options": []
        },
        {
            "id": 2,
            "label": "Siren alarm tone length",
            "description": "Total length of the sound versus silence within this interval.",
            "overview": "<p>The additional siren is creating a different acoustic signal differentiate from the smoke alarm. This sound is partly on and partly off. This parameter defines the total length of the sound versus silence within this interval.<\/p>",
            "size": 1,
            "bitmask": "00000000",
            "default": 10,
            "read_only": false,
            "write_only": false,
            "value_min": 3,
            "value_max": 129,
            "options": []
        },
        {
            "id": 3,
            "label": "Value of On-Command",
            "description": "",
            "overview": "",
            "size": 1,
            "bitmask": "00000000",
            "default": 99,
            "read_only": false,
            "write_only": false,
            "value_min": 0,
            "value_max": 99,
            "options": []
        },
        {
            "id": 4,
            "label": "Value of Off-Command",
            "description": "",
            "overview": "",
            "size": 1,
            "bitmask": "00000000",
            "default": 0,
            "read_only": false,
            "write_only": false,
            "value_min": 0,
            "value_max": 99,
            "options": []
        },
        {
            "id": 5,
            "label": "Status of automated meshing of smoke alarms",
            "description": "Inform other smoke detectors of same type about smoke alarms",
            "overview": "<p>This smoke detector can automatically inform other smoke detectors of same type about smoke alarms. They will then also turn on the siren. This function is a requirement of wireless networked smoke detectors.<\/p>",
            "size": 1,
            "bitmask": "00000000",
            "default": 1,
            "read_only": false,
            "write_only": false,
            "value_min": 0,
            "value_max": 255,
            "options": [
                {
                    "value": 0,
                    "label": "inactive"
                },
                {
                    "value": 1,
                    "label": "active"
                }
            ]
        },
        {
            "id": 6,
            "label": "Status of automated meshing of battery alarms",
            "description": "Inform other smoke detectors of same type about battery alarms",
            "overview": "<p>This smoke detector can automatically inform other smoke detectors of same type about battery alarms. They will then also turn on the siren. This function is a requirement of wireless networked smoke detectors.<\/p>",
            "size": 1,
            "bitmask": "00000000",
            "default": 1,
            "read_only": false,
            "write_only": false,
            "value_min": 0,
            "value_max": 255,
            "options": [
                {
                    "value": 0,
                    "label": "inactive"
                },
                {
                    "value": 1,
                    "label": "active"
                }
            ]
        }
    ],
    "associations": [
        {
            "id": 1,
            "label": "Lifeline",
            "max_nodes": 4,
            "controller": true,
            "description": "",
            "overview": ""
        },
        {
            "id": 2,
            "label": "Alarm Reports",
            "max_nodes": 4,
            "controller": false,
            "description": "",
            "overview": ""
        },
        {
            "id": 3,
            "label": "Switching Command when Alarm",
            "max_nodes": 4,
            "controller": false,
            "description": "",
            "overview": ""
        }
    ]
}