{
    "database_id": 103,
    "label": "ZG8101",
    "manufacturer_name": "Vision Security",
    "manufacturer_id": "0109",
    "device_ref": [
        "200A:0A02"
    ],
    "version_min": 0,
    "version_max": 255.255,
    "decription": "Garage Door Tilt Sensor",
    "overview": "<p>This sensor offers information whether a garage door is open or closed. It detect the horizontally or vertical position of the door. It is therefore required to mount it to the door in a way that it will also change the position from vertically to horizontally and back. The installation can be done with screws or double-sided tape. The device is battery-operated and therefore in sleeping mode unless an action is detected. After a programmable sleeping time the device wakes up and sends a status information. After this the unit goes back to sleeping modus. Batteries can be changed without unscrewing the device from the door or frame. The unit will give a visual warning on the device and sends a warning to the Z-Wave controller, when batteries need to be replaced. The units send information to a controller or any other associated Z-Wave device. Up to 5 devices can be controlled from this device. Two terminals allows the connection of an external dry contact in parallel to the position sensor. The powerful CR123 Lithium battery lasts 3 ... 5 years in normal operation conditions. The device supports normal Z-Wave inclusion, auto inclusion and network wide inclusion for convenient handling.<\/p>",
    "inclusion": "<p>On factory default the device does not belong to any Z-Wave network. The device needs to join an existing wireless network to communicate with the devices of this network. This process is called Inclusion. <\/p> <p>A single click for one second on the tampering switch inside the enclosure will confirm Inclusion and Exclusion.<\/p>",
    "exclusion": "<p>Devices can also leave a network. This process is called Exclusion. Both processes are initiated by the primary controller of the Z-Wave network. This controller will be turned into exclusion respective inclusion mode. Please refer to your primary controllers manual on how to turn your controller into inclusion or exclusion mode. Only if the primary controller is in inclusion or exclusion mode, this device can join or leave the network. Leaving the network - i.e. being excluded - sets the device back to factory default. If the device already belongs to a network, follow the exclusion process before including it in your network. Otherwise inclusion of this device will fail. If the controller being included was a primary controller, it has to be reset first.<\/p>",
    "wakeup": "<p>This device is battery operated and turned into deep sleep state most of the time to save battery life time. Communication with the device is limited. In order to communicate with the device, a static controller C is needed in the network. This controller will maintain a mailbox for the battery operated devices and store commands that can not be received during deep sleep state. Without such a controller, communication may become impossible and\/or the battery life time is significantly decreased. (c) 2016 Z-Wave Europe GmbH, Antonstr. 3, 09337 Hohenstein-Ernstthal, Germany, All rights reserved, www.zwaveeurope.com - pp 3 This device will wakeup regularly and announce the wakeup state by sending out a so called Wakeup Notification. The controller can then empty the mailbox. Therefore, the device needs to be configured with the desired wakeup interval and the node ID of the controller. If the device was included by a static controller this controller will usually perform all necessary configurations. The wakeup interval is a tradeoff between maximal battery life time and the desired responses of the device. Releasing the tampering switch will wake up the device and keep it awake   <\/p>",
    "protocol_version": 3.052,
    "listening": false,
    "frequently_listening": false,
    "routing": true,
    "beaming": false,
    "library_type": {
        "id": 7,
        "name": "LIB_CONTROLLER_BRIDGE"
    },
    "basic_class": {
        "id": 4,
        "name": "BASIC_TYPE_ROUTING_SLAVE"
    },
    "generic_class": {
        "id": 4,
        "name": "GENERIC_TYPE_SENSOR_BINARY"
    },
    "specific_class": {
        "id": 4,
        "name": "SPECIFIC_TYPE_ROUTING_SENSOR_BINARY"
    },
    "endpoints": [
        {
            "id": 0,
            "basic_class": {
                "id": 4,
                "name": "BASIC_TYPE_ROUTING_SLAVE"
            },
            "generic_class": {
                "id": 32,
                "name": "GENERIC_TYPE_SENSOR_BINARY"
            },
            "specific_class": {
                "id": 1,
                "name": "SPECIFIC_TYPE_ROUTING_SENSOR_BINARY"
            },
            "commandclasses": [
                {
                    "id": "00",
                    "name": "NO_OPERATION",
                    "version": "1",
                    "nif": false,
                    "basic": false,
                    "secure": false,
                    "nonsecure": true,
                    "config": "",
                    "channels": []
                },
                {
                    "id": "20",
                    "name": "BASIC",
                    "version": "1",
                    "nif": false,
                    "basic": false,
                    "secure": false,
                    "nonsecure": true,
                    "config": "",
                    "channels": []
                },
                {
                    "id": "30",
                    "name": "SENSOR_BINARY",
                    "version": "1",
                    "nif": false,
                    "basic": true,
                    "secure": false,
                    "nonsecure": true,
                    "config": "",
                    "channels": [
                        {
                            "type": "sensor_door",
                            "label": "Binary Sensor",
                            "config": []
                        }
                    ]
                },
                {
                    "id": "71",
                    "name": "ALARM",
                    "version": "2",
                    "nif": false,
                    "basic": false,
                    "secure": false,
                    "nonsecure": true,
                    "config": "",
                    "channels": [
                        {
                            "type": "alarm_burglar",
                            "label": "Alarm (door)",
                            "config": [
                                "type=BURGLAR",
                                " event=2"
                            ]
                        },
                        {
                            "type": "alarm_tamper",
                            "label": "Alarm (tamper)",
                            "config": [
                                "type=BURGLAR",
                                " event=3"
                            ]
                        }
                    ]
                },
                {
                    "id": "72",
                    "name": "MANUFACTURER_SPECIFIC",
                    "version": "1",
                    "nif": false,
                    "basic": false,
                    "secure": false,
                    "nonsecure": true,
                    "config": "",
                    "channels": []
                },
                {
                    "id": "80",
                    "name": "BATTERY",
                    "version": "1",
                    "nif": false,
                    "basic": false,
                    "secure": false,
                    "nonsecure": true,
                    "config": "",
                    "channels": []
                },
                {
                    "id": "84",
                    "name": "WAKE_UP",
                    "version": "2",
                    "nif": false,
                    "basic": false,
                    "secure": false,
                    "nonsecure": true,
                    "config": "",
                    "channels": []
                },
                {
                    "id": "85",
                    "name": "ASSOCIATION",
                    "version": "2",
                    "nif": false,
                    "basic": false,
                    "secure": false,
                    "nonsecure": true,
                    "config": "",
                    "channels": []
                },
                {
                    "id": "86",
                    "name": "VERSION",
                    "version": "1",
                    "nif": false,
                    "basic": false,
                    "secure": false,
                    "nonsecure": true,
                    "config": "",
                    "channels": []
                }
            ]
        }
    ],
    "parameters": [],
    "associations": [
        {
            "id": 1,
            "label": "Control Command",
            "max_nodes": 5,
            "controller": true,
            "description": "",
            "overview": ""
        }
    ]
}