{
    "database_id": 987,
    "label": "Zipato Multisensor 4 in 1",
    "manufacturer_name": "Zipato",
    "manufacturer_id": "0131",
    "device_ref": [
        "80B0D50C:0000"
    ],
    "version_min": 0,
    "version_max": 255.255,
    "decription": "door\/window contact sensor, humidity sensor, temperature sensor, and light sensor",
    "overview": "<p>The Zipato Multisensor 4 in 1 (door\/window contact sensor, humidity sensor, temperature sensor, and light sensor).<\/p> <p>This sensor is a Z-Wave enabled device (interoperable, two-way RF mesh networking technology) and is fully compatible with any Z-Wave enabled network and its security framework.<\/p> <p>Zipato Multisensor 4 in 1 sends Z-Wave signal when door or window is opened or closed or there is a humidity, temperature, luminance change. When the Zipato Multisensor 4 in 1 is included (added) into Z-Wave network, above mentioned communication will be encrypted.<\/p>",
    "inclusion": "<p>Put the Z-Wave Controller into “inclusion” mode, and follow its instruction to add the Multisensor 4 in 1 to your controller.<\/p> <p>To get in the “inclusion” mode, the distance between sensor and controller is suggested to be within one meter. Press the program switch once on Multisensor 4 in 1 for sending the NIF.<\/p> <p>After sending NIF, Z-Wave will send the auto inclusion; otherwise, if user presses the program switch, the red\/orange LED will flash 5 times if the Multisensor 4 in 1 will go to sleep after 20 seconds.<\/p>",
    "exclusion": "<p>Put the Z-Wave Controller into “exclusion” mode, and follow its instruction to delete the Multisensor 4 in 1 from your controller. Press the program switch of Multisensor 4 in 1 for 1 second at least to be excluded.<\/p> <p>Note: All user and network settings will be cleared and the device reset to factory defaults when the device is excluded.<\/p>",
    "wakeup": "<p>Use “Wake Up” command to set up the awaking time and send the wake up notification to controller. User can use command to change the auto wake up from 10 minutes to 1 week, Interval increment is 3 minutes.<\/p>",
    "protocol_version": 0,
    "listening": false,
    "frequently_listening": false,
    "routing": true,
    "beaming": false,
    "library_type": {
        "id": 0,
        "name": "Unknown"
    },
    "basic_class": {
        "id": 4,
        "name": "BASIC_TYPE_ROUTING_SLAVE"
    },
    "generic_class": {
        "id": 4,
        "name": "GENERIC_TYPE_SENSOR_NOTIFICATION"
    },
    "specific_class": {
        "id": 4,
        "name": "SPECIFIC_TYPE_NOTIFICATION_SENSOR"
    },
    "endpoints": [
        {
            "id": 0,
            "basic_class": {
                "id": 4,
                "name": "BASIC_TYPE_ROUTING_SLAVE"
            },
            "generic_class": {
                "id": 7,
                "name": "GENERIC_TYPE_SENSOR_NOTIFICATION"
            },
            "specific_class": {
                "id": 1,
                "name": "SPECIFIC_TYPE_NOTIFICATION_SENSOR"
            },
            "commandclasses": []
        }
    ],
    "parameters": [],
    "associations": []
}